export default {
    name: 'Українська',
    flag: '🇺🇦',
    wallets: 'Гаманці',
    profile: 'Профіль',
    dashboard: 'Мій профіль',
    signOut: 'Вийти',
    madeBy: 'Зроблено з ❤️ &nbsp;в&nbsp; 🇺🇦',
    signedAs: 'Увійшли як',
    optional: 'необов\'язково',

    theme: {
        theme: 'Тема',
        light: 'Світла',
        dark: 'Темна',
        system: 'Системна'
    },

    error: {
        captcha: 'Помилка перевірки Captcha, будь ласка, перезавантажте сторінку та спробуйте ще раз.',
        validation: 'Перевірте коректність введених даних.',
        googleLogin: 'Помилка авторизації за допомогою Google, будь ласка, перезавантажте сторінку та спробуйте ще раз.'
    },

    signIn: {
        title: 'Увійти - Cash Track',
        signIn: 'Увійти у ваш профіль',
        link: 'Увійти',
        email: 'Email',
        password: 'Пароль',
        login: 'Увійти',
        loginWithPasskey: 'Увійти Ключем Доступу',
        forgotPassword: 'Забули пароль?',
        dontHaveAccount: 'Досі не маєте аккаунту?',
        or: 'АБО'
    },

    passwordForgot: {
        title: 'Скидання Паролю - Cash Track',
        passwordForgot: 'Скиньте пароль вашого профілю',
        email: 'Email',
        reset: 'Скинути',
        success: {
            0: 'Посилання для скидання паролю надіслано на вашу Email адресу.',
            1: 'Виконуйте вказівки в повідомленні, для відновлення доступу до вашого аккаунту.',
            2: 'Зверніть увагу - посилання тимчасове, і може бути неактивне згодом.',
            3: 'Проте, Ви завжди зможете спробувати ще раз, використовуючи дану форму.'
        }
    },

    passwordReset: {
        title: 'Відновлення доступу - Cash Track',
        passwordReset: 'Встановіть новий пароль вашого профілю',
        newPassword: 'Новий пароль',
        newPasswordConfirmation: 'Новий пароль ще раз',
        reset: 'Зберегти',
        success: {
            0: 'Ваш пароль успішно змінено.',
            1: 'Тепер Ви можете',
            2: 'Увійти',
            3: 'використовуючи нові дані.'
        },
        codeInvalid: {
            0: 'Посилання для відновлення доступу не активне.',
            1: 'Будь ласка,',
            2: 'Створіть',
            3: 'запит на відновлення доступу ще раз.'
        }
    },

    emailConfirmation: {
        title: 'Підтвердження email - Cash Track',
        loading: 'Підтвердження email. Ще трохи..',
        success: {
            0: 'Ваш email успішно підтверджено.',
            1: 'Тепер можете',
            2: 'увійти',
            3: 'до Вашого аккаунту.'
        },
        successLogged: {
            0: 'Ваш email успішно підтверджено.',
            1: 'Вас буде перенаправлено до сторінки профілю.',
            2: 'Або переходьте самі до ',
            3: 'профілю'
        },
        codeInvalid: {
            0: 'Ваш email досі не підтверджено.',
            1: 'Посилання для підтвердження вже не активне.',
            2: 'Будь ласка, ',
            3: 'увійдіть',
            4: 'до налаштувань Вашого аккаунту та відправте запит на підтвердження повторно.'
        }
    },

    register: {
        title: 'Реєстрація - Cash Track',
        signUp: 'Створіть ваш профіль',
        link: 'Реєстрація',
        name: 'Ім\'я',
        lastName: 'Прізвище',
        nickName: 'Нік',
        email: 'Email',
        password: 'Пароль',
        passwordConfirmation: 'Пароль ще раз',
        confirmation: {
            0: 'Я прочитав/ла і погоджуюсь з',
            1: 'Політикою Конфіденційності'
        },
        register: 'Зареєструватись',
        or: 'АБО',
        alreadyHaveAccount: 'Вже маєте аккаунт?'
    },

    home: {
        title: 'Cash Track',
        header: 'Слідкуй за витратами',
        lead: 'Керувати доходами та витратами життєво необхідно, щоб знати, як покращити якість життя',
        banner: 'Використвуйте Cash Track безкоштовно. Ніяких комісій та підписок.',
        login: 'Увійти',
        or: 'або',
        register: 'Зареєструватись',
        wallets: 'Гаманці',

        easy: 'Легко',
        easyDescription: 'Зручний інтерфейс — нічого зайвого. Створюйте гаманець та починайте керувати Вашими доходами та витратами',
        fast: 'Швидко',
        fastDescription: 'Ми використовуємо одні з найшвидших серверів на дикому заході. Принаймні, нам так говорили їх продавці..',
        secure: 'Безпечно',
        secureDescription: 'Ваші дані захищено. Чутливі персональні дані зашифровано за допомогою криптографічно стійких алгоритмів',

        support: {
            header: 'Підтримуйте Україну',
            lead: 'Команда Cash Track не стоїть осторонь, а вносить свій вклад в численні ініціативи збору коштів. Це наша відповідальність - важко працювати та робити все, що від нас залежить, щоб допомогти нашій країні вижити. Приєднуйтесь до нас.',
            help: 'Як допомогти?'
        },

        telegram: {
            header: 'Телеграм',
            lead:
                'Відтепер у нас є власний Телеграм канал — там ми публікуємо огляд нових фіч, поточних можливостей, рекомендації з використання Cash Track',
            subscribe: 'Підписатись'
        }
    },

    about: {
        title: 'Про нас - Cash Track',
        link: 'Про нас',
        about: 'Про Cash Track',
        quote: 'Життя схоже на їзду велосипедом. Щоб зберігати баланс, потрібно рухатись.',
        quoteAuthor: 'Альберт Айнштайн',
        lines: {
            0: 'Cash Track це безкоштовний серіс з відкритим кодом, де Ви можете контролювати доходи та витрати.',
            1: 'Тут можна спільно вести облік фінансів разом з членами Вашої родини, друзями чи партнерами.',
            2: 'Ось деякі з фішок сервісу:'
        },
        features: {
            0: 'Безкоштовний',
            1: 'Можливість шерингу',
            2: 'Фільтрація та статистика',
            3: 'Система тегів'
        },

        connect: 'Приєднуйтесь і спробуйте власноруч.',
        register: 'Приєднатись',
        or: 'або',
        login: 'Увійти',

        tgChannel: {
            0: 'Приєднуйтесь до нашого каналу в Telegram, щоб бути в курсі оновлень та корисних рекомендацій з використання Cash Track.',
            1: 'Telegram Канал'
        },

        moreLines: {
            0: 'Ми працюємо над новими фішками та вирішенням існуючих проблем.',
            1: 'Якщо маєте пропозиції, або знайшли помилку і хочете про це повідомити - ми це цінуємо.',
            2: 'Переходьте',
            3: 'сюди',
            4: 'і створюйте новий тікет. Опишіть Вашу ідею або проблему якомога детальніше, додавайте скріншоти та очікуйте на фідбек.',
            5: 'Дякуємо, що приділили увагу!'
        }
    },

    help: {
        title: 'Допомога - Cash Track',
        link: 'Допомога',
        help: 'Допомога',
        notice: 'Цей розділ все ще наповнюється.'
    },

    cookiePolicy: {
        title: 'Політика Cookie - Cash Track',
        link: 'Про Cookie',
        cookiePolicy: 'Політика Cookie',
        effectiveDate: 'Дійсний з: 15-Кві-2023',
        lastUpdated: 'Оновлено: 15-Кві-2023',
        whatAreCookies: {
            0: '1. Що таке файли cookie?',
            1: 'Ця Політика щодо файлів cookie пояснює, що таке файли cookie та як ми їх використовуємо, типи файлів cookie, які ми використовуємо, тобто інформацію, яку ми збираємо за допомогою файлів cookie, і як ця інформація використовується, а також як керувати налаштуваннями файлів cookie.',
            2: 'Файли cookie — це невеликі текстові файли, які використовуються для зберігання невеликих фрагментів інформації. Вони зберігаються на вашому пристрої, коли веб-сайт завантажується у вашому браузері. Ці файли cookie допомагають нам забезпечити належну роботу веб-сайту, зробити його більш безпечним, забезпечити кращий досвід користувачів, зрозуміти, як працює веб-сайт, і проаналізувати, що працює, а що потребує вдосконалення.'
        },
        howDoWeUseCookies: {
            0: '2. Як ми використовуємо файли cookie?',
            1: 'Як і більшість онлайн-сервісів, наш веб-сайт використовує основні та сторонні файли cookie для кількох цілей. Основні файли cookie здебільшого необхідні для правильного функціонування веб-сайту, і вони не збирають ваші особисті дані.',
            2: 'Файли cookie третіх сторін, які використовуються на нашому веб-сайті, в основному призначені для розуміння того, як веб-сайт працює, як ви взаємодієте з нашим веб-сайтом, для забезпечення безпеки наших послуг, надання реклами, яка вам доречна, і загалом, забезпечуючи вам кращий і покращений досвід користувача та допомагаючи пришвидшити вашу подальшу взаємодію з нашим веб-сайтом.'
        },
        typesOfCookiesWeUse: '3. Типи файлів cookie, які ми використовуємо',
        cookieSettings: 'Налаштування файлів cookie',
        manageCookiesPreferences: {
            0: '4. Керуйте налаштуваннями файлів cookie',
            1: 'Ви можете будь-коли змінити свої налаштування файлів cookie, натиснувши кнопку вище. Це дозволить вам знову переглянути банер згоди щодо файлів cookie та змінити свої налаштування або негайно відкликати свою згоду.',
            2: 'Крім того, різні браузери пропонують різні методи блокування та видалення файлів cookie, які використовуються веб-сайтами. Ви можете змінити налаштування свого браузера, щоб заблокувати/видалити файли cookie. Нижче наведено посилання на допоміжні документи про те, як керувати та видаляти файли cookie з основних веб-браузерів.',
            3: 'Якщо ви користуєтеся будь-яким іншим веб-браузером, перегляньте офіційні документи підтримки вашого браузера.'
        }
    },

    privacyPolicy: {
        title: 'Політика Конфіденційності - Cash Track',
        link: 'Про Конфіденційність',
        privacyPolicy: 'Політика Конфіденційності',
        effectiveDate: 'Дійсний з: 15-Кві-2023',
        lastUpdated: 'Оновлено: 15-Кві-2023',
        intro: {
            0: 'Ця Політика конфіденційності описує політику Cash Track, Вінниця, 22600, Україна, електронна адреса: {email} щодо збору, використання та розкриття вашої інформації, яку ми збираємо, коли ви використовуєте наш веб-сайт ( https://cash-track.app ). (далі “Сервіс”). Отримуючи доступ до Сервісу або використовуючи його, ви погоджуєтеся на збір, використання та розкриття вашої інформації відповідно до цієї Політики конфіденційності. Якщо ви не погоджуєтеся з цим, будь ласка, не отримуйте доступ до Сервісу та не використовуйте його.',
            1: 'Ми можемо змінити цю Політику конфіденційності в будь-який час без будь-якого попереднього повідомлення та опублікуємо переглянуту Політику конфіденційності в Сервісі.. Переглянута Політика набуде чинності через 180 днів із моменту публікації переглянутої Політики в Сервісі, і ваш подальший доступ або використання Сервісу після цього часу означатиме, що ви погоджуєтеся з переглянутою Політикою конфіденційності. Тому ми рекомендуємо вам періодично переглядати цю сторінку.'
        },
        infoWeCollect: {
            0: '1. Інформація, Яку Ми Збираємо:',
            1: 'Ми збиратимемо та оброблятимемо наступну особисту інформацію про вас:',
            2: 'Імʼя',
            3: 'Прізвище',
            4: 'Email',
            5: 'Соціальний Медіа Профіль',
            6: 'Нік'
        },
        howWeCollectInfo: {
            0: '2. Як Ми Збираємо Вашу Інформацію:',
            1: 'Ми збираємо/отримуємо інформацію про вас у такий спосіб:',
            2: 'Коли користувач заповнює реєстраційну форму або іншим чином надає особисту інформацію',
            3: 'Взаємодіє з веб-сайтом',
            4: 'З відкритих джерел'
        },
        howWeUseInfo: {
            0: '3. Як Ми Використовуємо Вашу Інформацію:',
            1: 'Ми використовуватимемо інформацію, яку збираємо про вас, для наступних цілей:',
            2: 'Створення облікового запису користувача',
            3: 'Коментарі від користувача до користувача',
            4: 'Керувати обліковим записом користувача',
            5: 'Якщо ми хочемо використовувати вашу інформацію для будь-якої іншої мети, ми запитаємо у вас згоду та використовуватимемо вашу інформацію лише після отримання вашої згоди, а потім лише для цілей, для яких надано згоду, якщо від нас не вимагається вчинити інакше закон.'
        },
        howWeShareInfo: {
            0: '4. Як Ми Ділимося Вашою Інформацією:',
            1: 'Ми не будемо передавати вашу особисту інформацію будь-якій третій стороні без вашої згоди, за винятком обмежених обставин, описаних нижче:',
            2: 'Аналітика',
            3: 'Ми вимагаємо, щоб такі треті сторони використовували особисту інформацію, яку ми їм передаємо, лише з метою, для якої її було передано, і не зберігали її довше, ніж це потрібно для досягнення зазначеної мети.',
            4: 'Ми також можемо розкривати вашу особисту інформацію для наступного: (1) для дотримання чинного законодавства, нормативних актів, ухвал суду чи іншого судового процесу; (2) для забезпечення виконання ваших угод з нами, включаючи цю Політику конфіденційності; або (3) для відповіді на претензії про те, що ваше використання Сервісу порушує права третіх осіб. Якщо Службу або нашу компанію об’єднано або придбано іншою компанією, ваша інформація стане одним із активів, які передаються новому власнику.'
        },
        retentionInfo: {
            0: '5. Зберігання Вашої Інформації:',
            1: 'Ми зберігатимемо вашу особисту інформацію від 90 днів до 2 років після того, як користувачі припинять дію своїх облікових записів, або до тих пір, поки вона нам потрібна для досягнення цілей, для яких вона була зібрана, як зазначено в цій Політиці конфіденційності. Нам може знадобитися зберігати певну інформацію протягом більш тривалого періоду, як-от ведення записів/звітності відповідно до чинного законодавства або з інших законних причин, як-от дотримання законних прав, запобігання шахрайству тощо. Залишкова анонімна інформація та сукупна інформація, жодна з яких не ідентифікує вас (прямо чи опосередковано), можуть зберігатися необмежений час.'
        },
        yourRights: {
            0: '6. Ваші права:',
            1: 'Залежно від чинного законодавства ви можете мати право на доступ, виправлення чи видалення ваших персональних даних або отримання копії ваших персональних даних, обмеження або заперечення проти активної обробки ваших даних, попросити нас поділитися (перенести) ваші персональні дані іншій організації, відкликати будь-яку згоду, яку ви надали нам на обробку ваших даних, право подати скаргу до встановленого законом органу та такі інші права, які можуть мати відношення відповідно до чинного законодавства. Щоб скористатися цими правами, ви можете написати нам на {email}. Ми відповімо на ваш запит відповідно до чинного законодавства.',
            2: 'Зауважте, що якщо ви не дозволите нам збирати або обробляти необхідну особисту інформацію або відкликаєте згоду на її обробку для потрібних цілей, ви можете не мати доступу або використовувати служби, для яких потрібна ваша інформація.'
        },
        cookies: {
            0: '7. Файли Сookie Тощо.',
            1: 'Щоб дізнатися більше про те, як ми використовуємо ці технології відстеження, і про ваш вибір щодо цих технологій відстеження, зверніться до нашої',
            2: 'Політики Cookie'
        },
        security: {
            0: '8. Безпека:',
            1: 'Безпека вашої інформації важлива для нас, і ми вживатимемо розумні заходи безпеки, щоб запобігти втраті, неправильному використанню або несанкціонованій зміні вашої інформації під нашим контролем. Однак, враховуючи притаманні ризики, ми не можемо гарантувати абсолютну безпеку, а отже, ми не можемо гарантувати безпеку будь-якої інформації, яку ви нам передаєте, і ви робите це на свій власний ризик.'
        },
        dataProtection: {
            0: '9. Скарга / Спеціаліст із захисту даних:',
            1: 'Якщо у вас є будь-які запитання чи сумніви щодо обробки вашої інформації, доступної нам, ви можете надіслати електронного листа нашому спеціалісту з розгляду скарг у Cash Track, Вінниця, на електронну адресу: {email}. Ми розглянемо ваші проблеми відповідно до чинного законодавства.'
        }
    },

    securityAcknowledgement: {
        title: 'Дослідники Безпеки - Cash Track',
        link: 'Дослідники Безпеки',
        securityAcknowledgement: 'Дослідники Безпеки',
        effectiveDate: 'Дійсний з: 17-Тра-2025',
        lastUpdated: 'Оновлено: 17-Тра-2025',

        about: {
            0: 'Ця сторінка присвячена дослідникам вразливостей, які відповідально виявили та повідомили нам про викриті вразливості системи. Їх вклад є безцінною допомогою нам у підтримці безпеки та цілісності системи.'
        },
        researchers: {
            0: 'Нижче перелік дослідників, які зробили значний вклад, разом з датою звіту про вразливості.',
            1: 'На сьогодні ми очікуємо на перший звіт про вразливості. Ми відкриті до будь яких безпекових неполадок і будемо раді відзначити ваш вклад на цій сторінці.'
        }
    },

    securityPolicy: {
        title: 'Політика Безпеки - Cash Track',
        link: 'Політика Безпеки',
        securityAcknowledgement: 'Політика Безпеки',
        effectiveDate: 'Дійсний з: 17-Тра-2025',
        lastUpdated: 'Оновлено: 17-Тра-2025',
        intro: {
            0: 'Ми серйозно ставимося до безпеки нашого веб-сервісу та цінуємо зусилля дослідників безпеки та користувачів, які допомагають нам підтримувати безпечне середовище. Ця Політика Безпеки описує процедури звітування про вразливості, юридичні умови, пов\'язані з неповідомленням про них, та терміни публічного розкриття, якщо ми не відповідаємо.'
        },
        reporting: {
            0: 'Повідомлення про Вразливості',
            1: 'Якщо ви виявили вразливість безпеки в нашому веб-сервісі, будь ласка, негайно повідомте нам про це. Ви можете повідомити про вразливості, надіславши електронного листа на адресу {email}. Будь ласка, включіть наступну інформацію у свій звіт:',
            2: 'Детальний опис вразливості',
            3: 'Кроки для відтворення вразливості',
            4: 'Будь-який потенційний вплив вразливості',
            5: 'Ваша контактна інформація (необов\'язково, але корисно для подальшого зв\'язку)',
            6: 'Ми підтвердимо отримання вашого звіту якомога швидше та працюватимемо над вирішенням проблеми якнайшвидше.'
        },
        legal: {
            0: 'Юридичні Умови Неповідомлення про Вразливості',
            1: 'Хоча ми заохочуємо відповідальне розкриття вразливостей безпеки, ми також розуміємо, що можуть бути юридичні наслідки за неналежне повідомлення про них. Не повідомляючи про вразливість і натомість експлуатуючи її або розкриваючи її публічно, не давши нам можливості вирішити проблему, ви можете порушувати відповідні закони та норми, включаючи, але не обмежуючись:',
            2: 'Закон про комп\'ютерне шахрайство та зловживання (CFAA)',
            3: 'Загальний регламент про захист даних (GDPR)',
            4: 'Інші місцеві, державні чи федеральні закони',
            5: 'Ми залишаємо за собою право вживати юридичних заходів проти осіб або організацій, які експлуатують вразливості без повідомлення про них або які публічно розкривають вразливості, не дотримуючись процедур, викладених у цій політиці.'
        },
        timeline: {
            0: 'Графік Розкриття',
            1: 'Якщо ви повідомляєте про вразливість і не отримуєте відповіді протягом 14 днів, або якщо ми не вирішуємо проблему протягом 90 днів після вашого звіту, ви можете публічно розкрити вразливість. Однак ми люб\'язно просимо вас:',
            2: 'Надати нам розумну можливість вирішити проблему перед публічним розкриттям.',
            3: 'Редагувати будь-яку конфіденційну інформацію у вашому публічному розкритті, щоб мінімізувати потенційну шкоду.',
            4: 'Ми вважаємо, що 90 днів - це розумний термін для розслідування та вирішення більшості вразливостей. Якщо нам потрібно більше часу, ми повідомимо вам про це та надаватимемо регулярні оновлення про наш прогрес.'
        },
        reward: {
            0: 'Винагороди за Повідомлення про Вразливості',
            1: 'Ми цінуємо зусилля дослідників безпеки, які допомагають нам покращити нашу безпеку. Щоб показати нашу вдячність, ми можемо запропонувати грошові винагороди за звіти про дійсні, раніше невідомі вразливості, які розкриваються відповідально.',
            2: 'Критерії Винагороди',
            3: 'Вразливість повинна бути раніше невідома нам.',
            4: 'Звіт повинен надати достатньо деталей для відтворення проблеми.',
            5: 'Вразливість повинна бути в межах сервісів (тобто впливати на наші системи чи дані).',
            6: 'Повідомлювач повинен дотримуватися нашої політики розкриття.',
            7: 'Вразливість повинна бути достатньої серйозності.',
            8: 'Рішення про надання винагороди приймається на наш власний розсуд.'
        },
        thanks: {
            0: 'Дякуємо',
            1: 'Ми цінуємо вашу допомогу в підтримці безпеки нашого веб-сервісу. Якщо у вас є питання щодо цієї Політики Безпеки або потрібна додаткова допомога, будь ласка, зв\'яжіться з нами за адресою {email}.'
        }
    }
}
